; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	thermograph2 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
)
(:goal (and
	(pointing satellite0 Planet6)
	(pointing satellite1 GroundStation0)
	(have_image Planet5 thermograph0)
	(have_image Planet6 infrared3)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon8 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation3 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation0 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 6
6. (take_image satellite1 phenomenon7 instrument3 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 1 of 6
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 6
8. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 6
9. (turn_to satellite0 phenomenon8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 6
10. (take_image satellite0 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 2 of 6
11. (turn_to satellite0 planet5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet5)
   goals met: 2 of 6
12. (take_image satellite0 planet5 instrument2 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 3 of 6
13. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   goals met: 4 of 6
14. (take_image satellite0 planet6 instrument2 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 5 of 6
15. (turn_to satellite1 groundstation0 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation0)
   goals met: 6 of 6
